FreeCAD/data/defaults/0/k
%{%(physics/Turbulence%)
%:RANS
%[_header%]
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform %(initialValues/k%);

boundaryField
{

%{%(boundaries%)
%{%(boundaries/%(0%)/BoundaryType%)
%:empty
%[0/_boundary_empty%]
%:wall
%{%(boundaries/%(0%)/BoundarySubtype%)
%:fixed translating partialSlip rough
    %(0%)
    {
        type        kqRWallFunction;
        value       $internalField;
    }
%:slip
%[0/_boundary_zeroGradient%]
%}
%:inlet open farField
%{%(boundaries/%(0%)/TurbulenceInletSpecification%)
%:TKEAndSpecDissipationRate
    %(0%)
    {
        type        inletOutlet;
        inletValue  uniform %(boundaries/%(0%)/TurbulentKineticEnergy%);
        value       $internalField;
    }
%:intensityAndLengthScale
    %(0%)
    {
        type        turbulentIntensityKineticEnergyInlet;
        intensity   %(boundaries/%(0%)/TurbulenceIntensity%);
        value       $internalField;
    }
%}
%:outlet
    %(0%)
    {
        type        inletOutlet;
        inletValue  $internalField;
        value       $internalField;
    }
%:constraint
%[0/_boundary_constraint%]
%:baffle
%[0/_boundary_cyclic_baffle%]
%}

%}
%{defaultFaces
%[0/_boundary_zeroGradient%]
%}

}

// ************************************************************************* //
%}