FreeCAD/data/defaults/constant/g
%{%(solver/solverName%)
%:interFoam multiphaseInterFoam
%[_header%]
FoamFile
{
    version     2.0;
    format      ascii;
    class       uniformDimensionedVectorField;
    object      g;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -2 0 0 0 0];
value           (%(physics/Gravity/gx%) %(physics/Gravity/gy%) %(physics/Gravity/gz%));

// ************************************************************************* //
%}
