FreeCAD/data/defaults/system/decomposeParDict
%[_header%]
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

numberOfSubdomains  %(solver/parallelCores%);

method              scotch;

// ************************************************************************* //
